app/views/upvoteqs/upvoteToggle.js.erb

console.log("<%=@upvoteq%>")
$("#upcount_question_<%=@question.id%>").text("<%= @question.upvoteqs.count %>")
$("#downcount_question_<%=@question.id%>").text("<%= @question.downvoteqs.count %>")
---
SELECT COUNT(*) FROM "upvoteqs" WHERE "upvoteqs"."question_id" = ?  [["question_id", 1]]
SELECT COUNT(*) FROM "downvoteqs" WHERE "downvoteqs"."question_id" = ?  [["question_id", 1]]