app/views/home/_question.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "questions" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "wow.. how this app works?\r\n"], ["user_id", 1], ["created_at", "2017-07-29 22:52:06.583947"], ["updated_at", "2017-07-29 22:52:06.583947"]]
---
			<div class="buttonFlex">
					asked by <%=question.user.firstName%> <%=question.user.lastName%>
					on <%=question.created_at.strftime("%b %d,%y")%>

SELECT "questions".* FROM "questions"  ORDER BY "questions"."created_at" DESC
SELECT "upvoteqs".* FROM "upvoteqs" WHERE "upvoteqs"."question_id" = ? AND "upvoteqs"."user_id" = ?  [["question_id", 1], ["user_id", 1]]
SELECT COUNT(*) FROM "upvoteqs" WHERE "upvoteqs"."question_id" = ?  [["question_id", 1]]
SELECT "downvoteqs".* FROM "downvoteqs" WHERE "downvoteqs"."question_id" = ? AND "downvoteqs"."user_id" = ?  [["question_id", 1], ["user_id", 1]]
SELECT COUNT(*) FROM "downvoteqs" WHERE "downvoteqs"."question_id" = ?  [["question_id", 1]]
---

			<%= link_to 'Upvote', url_for(controller: 'upvoteqs', action: 'upvoteToggle', question: question.id), method: :post,id: "upvote_question_#{question.id}", remote: true, class: question.classStringQuestion(current_user.id) %>   <span id="upcount_question_<%=question.id%>"><%= question.upvoteqs.count %></span>

			<%= link_to 'Downvote', url_for(controller: 'downvoteqs', action: 'downvoteToggle', question: question.id), method: :post,id: "downvote_question_#{question.id}",remote: true, class: question.classStringQuestionDownVote(current_user.id) %>   <span id="downcount_question_<%=question.id%>"><%= question.downvoteqs.count %></span>

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  ORDER BY "answers"."created_at" DESC  [["question_id", 1]]
---
<%end%>
			<% answers = Answer.where(question_id: question.id).order(created_at: :desc)%>