app/controllers/home_controller.rb

SELECT "questions".* FROM "questions"  ORDER BY "questions"."created_at" DESC
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  ORDER BY "answers"."created_at" DESC  [["question_id", 1]]
---
  def index

  	respond_to do |format|
  		format.html{
  			@question=Question.new
  			@question_feed=Question.all.order(created_at: :desc)
  			@answer=Answer.new
  			@answer_feed=Answer.all.order(created_at: :desc)