app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)
     @question.user_id=current_user.id


    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "wow.. how this app works?\r\n"], ["user_id", 1], ["created_at", "2017-07-29 22:52:06.583947"], ["updated_at", "2017-07-29 22:52:06.583947"]]