app/controllers/upvoteqs_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "upvoteqs".* FROM "upvoteqs" WHERE "upvoteqs"."question_id" = ? AND "upvoteqs"."user_id" = ?  ORDER BY "upvoteqs"."id" ASC LIMIT 1  [["question_id", 1], ["user_id", 1]]
SELECT  "downvoteqs".* FROM "downvoteqs" WHERE "downvoteqs"."question_id" = ? AND "downvoteqs"."user_id" = ?  ORDER BY "downvoteqs"."id" ASC LIMIT 1  [["question_id", 1], ["user_id", 1]]
INSERT INTO "upvoteqs" ("question_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["question_id", 1], ["user_id", 1], ["created_at", "2017-07-29 22:52:22.595308"], ["updated_at", "2017-07-29 22:52:22.595308"]]
---
	def upvoteToggle
		ques = params[:question]
		@question = Question.find(ques);
		@upvoteq = Upvoteq.where(question_id:ques,user_id:current_user.id).first
		upvoteq = @upvoteq
		@downvoteq = Downvoteq.where(question_id:ques,user_id:current_user.id).first
		downvoteq = @downvoteq
		if upvoteq
			upvoteq.destroy
		else

			if downvoteq
				downvoteq.destroy
			end
			upvoteq = Upvoteq.new
			upvoteq.question_id = ques
			upvoteq.user_id = current_user.id
			upvoteq.save